In [6]:
import pandas as pd

li=[1,2,3,4]
a=pd.Series(li,index=['a','b','c','d'])
a

a    1
b    2
c    3
d    4
dtype: int64

In [8]:
dis={
    "name":["abc","xyz","anku"],
    "salary":[20000,10000,23000]
}
a=pd.Series(dis)
a

name           [abc, xyz, anku]
salary    [20000, 10000, 23000]
dtype: object

In [9]:
s1=pd.Series(12,index=[1,2,3,4,5,6])
s2=pd.Series(12,index=[2,4,5])
print(s1+s2)

1     NaN
2    24.0
3     NaN
4    24.0
5    24.0
6     NaN
dtype: float64

In [10]:
import pandas as pd
list=[1,2,3,4,5]
var=pd.DataFrame(list)
var

   0
0  1
1  2
2  3
3  4
4  5

In [12]:
dis={
    "name":["abc","xyz","anku"],
    "salary":[20000,10000,50000]
}
ab=pd.DataFrame(dis)
ab

   name  salary
0   abc   20000
1   xyz   10000
2  anku   50000

In [13]:
li=[[3,4,5,6],[5,6,7,8]]
sb=pd.DataFrame(li)
sb

   0  1  2  3
0  3  4  5  6
1  5  6  7  8

In [16]:
import pandas as pd
var=pd.DataFrame({
    "a":[2,4,5],
    "b":[6,8,9]
})
var["c"]=var["a"]*var["b"]
var["c"]

0    12
1    32
2    45
Name: c, dtype: int64